{
    "jobs": [
        {
            "dateRange": "April 2022 - present",
            "locationText": "Guadalajara, Jalisco. México",
            "companyName": "NTD Software.",
            "positionName": "Senior Frontend Developer at Neurothink Inc.",
            "jobDescription": [
                "Neurothink is a Network resource provider startup for Machine Learning and AI by providing",
                "industry-leading compute and virtualization resources in a secure, customizable and automated workflow.",
                "I am in charge of all the Frontend application development phase for delivering to the final user proper access to",
                "Machine Learning virtualization CPUs and GPUs with a variety of different memberships stating from the basic amount",
                "to advanced ones for more robust projets. Using React and Redux for storage, and Django with Python 3 in the backend."
            ]
        },
        {
            "dateRange": "Nov. 2019 - April 2022",
            "locationText": "Guadalajara, Jalisco. México",
            "companyName": "Luxoft - DXC",
            "positionName": "Software Development Engineer II at Expedia",
            "jobDescription": [
                "I have been being working with Luxoft for a while, within a great project Expedia.",
                "The initial work was a migration for an old stack with JSP as the main core of the",
                "Expedia pages, to a new progressive web application with React, TypeScript and",
                "Java/Kotlin. Here I haveve contributed in creation of microservices using Kotlin, and",
                "crafting the new homepage UI across different Expedia sites in the world",
                "Worked with a11y, localization and best code practices.",
                "Recognized as a Core Approver member team for the main domain application",
                "across different Expedia brands."
            ]
        },
        {
            "dateRange": "Sept. 2017 – Nov. 2019",
            "locationText": "Guadalajara, Jalisco. México",
            "companyName": "Unosquare",
            "positionName": "Intern - Software Development Engineer I at Foundation Medicine Inc.",
            "jobDescription": [
                "I started my professional career with Unosquare. I joined the company as an Intern to start developing software for helping",
                "physicians and patients defeat cancer diseases in Foundation Medicine Inc. When the internship has finished,",
                "Unosquare and Foundation Medicine offered me a full time employee position to continue working with them. ",
                "I was involved developing web and mobile application focused on JavaScript technologies such as Express.js,",
                "React and React Native."
            ]
        }
    ]
}
